#Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу,
# которая проверяет счастливость билета.

num = int(input('Введите шестизначный номер билета: '))
b = num // 100000
c = (num // 10000) % 10
d = (num // 1000) % 10
e = (num // 100 ) % 10
f = (num // 10) % 10
g = num % 10

left_side = b + c + d
right_side = e + f + g
if left_side == right_side:
    print('Билет счастливый! =)')
else:
    print('Билет не счастливый =(')